{
    "MODULEDATA":"v1.0.0",
    "_ONTOLOGY": {    
        "S": {
            "A1":{
                "withinarea":"Within the area of physical and chemical changes",
                "T1":{
                    "wewillselect":"we will select the topic crystal growth",
                    "belowarevariables":"Below are some variables that might affect the amount of crystal growth on a string in water.",
                    "enumVar1":"Water temperature",
                    "enumVar2":"The type of crystals",
                    "enumVar3":"The initial amount of crystals on the string",
                    "enumVar4":"The type of string",
                    "enumUtt4":"And the type of string",
                    "enumMat1":"A glass jar",
                    "enumMat2":"A calendar",
                    "enumMat3":"A pencil",
                    "enumMat4":"String",
                    "enumMat5":"Distilled water",
                    "enumMat6":"Crystals",
                    "enumMat7":"and a digital scale",
                    "enumProcess1":"We will mix a crystal salt or sugar in water so it dissolves.",
                    "enumProcess2":"We will continue to add the crystals and mix until not more crystals can be dissolved in the water. This is the saturation point.",
                    "enumProcess3":"Then we will put a string in the water.",
                    "enumProcess4":"We can measure the weight of the crystal growth after two weeks.",
                    "fourcanchange":"In this experiment, there are only four things we can change. Any of these might make a difference in the amount of crystal growth on a string in water. These are the four variables you can test in this experiment",
                    "enumValue1a":"The water temperature which can be cool.",
                    "enumValue1b":"Or hot might make a difference.",
                    "enumValue2a":"The type of crystal which can be salt",
                    "enumValue2b":"Or brown sugar might make a difference.",
                    "enumValue3a":"The initial amount of crystals on the string which can be none",
                    "enumValue3b":"Or some might make a difference.",
                    "enumValue4a":"And the type of string which can be twine.",
                    "enumValue4b":"Or yarn. This might also make a difference.",
                    "rqselectedall":" affect the weight of the crystal growth on a string in water after two weeks?",
                    "RQ1":{
                        "rqselected":"Does the water temperature" 
                    },
                    "RQ2":{
                        "rqselected":"Does the type of crystal"   
                    },
                    "RQ3":{
                        "rqselected":"Does the initial amount of crystals on the string"
                    },
                    "RQ4":{
                        "rqselected":"Does the type of string"    
                    }
                },
                "T2":{
                    "wewillselect":"we will select the topic soda mint reactions",
                    "belowarevariables":"Below are some variables that might affect the reaction between soda and mints.",
                    "enumVar1":"The type of sweetener in the soda",
                    "enumVar2":"The amount of caffeine in the soda",
                    "enumVar3":"The surface area of the mint",
                    "enumVar4":"The amount of carbon dioxide in the soda",
                    "enumUtt4":"And the amount of carbon dioxide in the soda",
                    "enumMat1":"A mint",
                    "enumMat2":"a bottle of soda",
                    "enumMat3":"and a ruler",
                    "enumProcess1":"We will put a single mint into a bottle of soda.",
                    "enumProcess2":"Bubbles forming a soda geyser may come out of the bottle.",
                    "enumProcess3":"We can measure the height of the soda geyser.",
                    "fourcanchange":"In this experiment, there are only four things we can change. Any of these might make a difference in the reaction between the soda and mint. These are the four variables you can test in this experiment",
                    "enumValue1a":"The type of sweetener which can be sugar",
                    "enumValue1b":"Or aspartame might make a difference",
                    "enumValue2a":"The amount of caffeine in the soda which can be some",
                    "enumValue2b":"Or none might make a difference",
                    "enumValue3a":"The surface texture of the mint, which can be rough",
                    "enumValue3b":"Or smooth might make a difference",
                    "enumValue4a":"And the amount of carbon dioxide in the soda which can be higher",
                    "enumValue4b":"Or lower. This might also make a difference",
                    "rqselectedall":" affect the strength of the reaction between soda and mints?",
                    "RQ1":{
                        "rqselected":"Does the type of sweetener in the soda"
                        },
                    "RQ2":{
                        "rqselected":"Does the type of crystal in the soda"
                        },
                    "RQ3":{
                        "rqselected":"Does the surface texture of the mint"
                        },
                    "RQ4":{
                        "rqselected":"Does the amount of carbon dioxide in the soda"
                        }
                }
            },
            "A2":{
                "withinarea":"Within the area of, heat and temperature",
                "T1":{
                    "wewillselect":"we will select the topic ice melting time",
                    "belowarevariables":"Below are some variables that might affect the time it takes for an ice cube to melt in water.",
                    "enumVar1":"The initial temperature of the ice cube",
                    "enumVar2":"The initial temperature of the water",
                    "enumVar3":"The pattern on the glass",
                    "enumVar4":"The shape of the glass",
                    "enumUtt4":"And the shape of the glass",
                    "enumMat1":"A thermometer",
                    "enumMat2":"Glass cups",
                    "enumMat3":"Ice cubes and ice bucket",
                    "enumMat4":"Water",
                    "enumMat5":"And a digital clock",
                    "enumProcess1":"We will place an ice cube in a glass filled with 237 milliliters of water.",
                    "enumProcess2":"The ice cube will eventually completely melt.",
                    "enumProcess3":"We can measure the time it takes for the ice cube to melt in water.",
                    "fourcanchange":"In this experiment, there are only four things we can change. Any of these might make a difference in the time it takes for the ice cube to melt in water. These are the four variables you can test in this experiment",
                    "enumValue1a":"the initial temperature of the ice cube which can be zero degrees Celsius",
                    "enumValue1b":"Or negative twenty degrees Celsius might make a difference",
                    "enumValue2a":"The initial temperature of the water which can be cold",
                    "enumValue2b":"Or hot might make a difference",
                    "enumValue3a":"The pattern on the glass which can be striped",
                    "enumValue3b":"Or plain might make a difference",
                    "enumValue4a":"And the shape of the glass which can be shorter or",
                    "enumValue4b":"Taller. This might also make a difference",
                    "rqselectedall":" affect the time it takes for an ice cube to melt in water?",
                    "RQ1":{
                        "rqselected":"Does the initial temperature of the ice cube"
                        },
                    "RQ2":{
                        "rqselected":"Does the initial temperature of the water"
                        },
                    "RQ3":{
                        "rqselected":"Does the pattern on the glass"
                        },
                    "RQ4":{
                        "rqselected":"Does the shape of the glass"
                        }
                },
                "T2":{
                    "wewillselect":"we will select the topic temperature of a gas",
                    "belowarevariables":"Below are some variables that might affect the temperature of gas in a balloon.",
                    "enumVar1":"The color of the balloon",
                    "enumVar2":"The material the balloon is made of",
                    "enumVar3":"The amount of sunlight exposure the balloon gets",
                    "enumVar4":"The type of chair the balloon is tied to",
                    "enumUtt4":"And the type of chair the balloon is tied to",
                    "enumMat1":"A balloon",
                    "enumMat2":"A wireless temperature reader and sensor",
                    "enumMat3":"A chair",
                    "enumMat4":"A stopwatch",
                    "enumMat5":"A helium tank",
                    "enumMat6":"And an umbrella",
                    "enumProcess1":"We will pump 5 grams of Helium at 15 degrees Celsius into a balloon.",
                    "enumProcess2":"Then we will place the balloon outside for 30 minutes.",
                    "enumProcess3":"The temperature of the outside air is 27 degrees Celsius.",
                    "enumProcess4":"We can measure the temperature of the gas after 30 minutes.",
                    "fourcanchange":"In this experiment, there are only four things we can change. Any of these might make a difference in the temperature of gas in the balloon. These are the four variables you can test in this experiment",
                    "enumValue1a":"The color of the balloon, which can be lighter",
                    "enumValue1b":"Or darker might make a difference",
                    "enumValue2a":"The material the balloon is made of which can be foil",
                    "enumValue2b":"Or latex might make a difference",
                    "enumValue3a":"The amount of sunlight exposure the balloon gets, which can be full sun",
                    "enumValue3b":"Or shade might make a difference",
                    "enumValue4a":"And the type of chair the balloon is tied to, which can be a wooden chair",
                    "enumValue4b":"Or a canvas chair. This might also make a difference",
                    "rqselectedall":" affect the gas temperature within the balloon after 30 minutes?",
                    "RQ1":{
                        "rqselected":"Does the color of the balloon"
                        },
                    "RQ2":{
                        "rqselected":"Does material the balloon is made of"
                        },
                    "RQ3":{
                        "rqselected":"Does the amount of sunlight exposure the balloon gets"
                        },
                    "RQ4":{
                        "rqselected":"Does the type of chair the balloon is tied to"
                        }
                }
            },
            "A3":{
                "withinarea":"Within the area of, forces and motion",
                "T1":{
                    "wewillselect":"we will select the topic the speed of balls at the bottom of ramps",
                    "belowarevariables":"Below are some variables that might affect the speed of balls at the bottom of ramps.",
                    "enumVar1":"The Slope of the Ramp",
                    "enumVar2":"The Color of the Ball",
                    "enumVar3":"The Starting Position of the Ball",
                    "enumVar4":"The Surface Texture of the Ramp",
                    "enumUtt4":"And the Surface Texture of the Ramp",
                    "enumMat1":"A speedometer",
                    "enumMat2":"A ramp",
                    "enumMat3":"And a ball",
                    "enumProcess1":"We will place a ball on the ramp.",
                    "enumProcess2":"The ball will roll down the ramp.",
                    "enumProcess3":"We will measure the balls speed at the bottom of the ramp.",
                    "fourcanchange":"In this experiment, there are only four things we can change. Any of these might make a difference in the speed of the ball at the bottom of the ramp. These are the four variables you can test in this experiment",
                    "enumValue1a":"The slope of the ramp, which can be steep",
                    "enumValue1b":"Or not steep might make a difference",
                    "enumValue2a":"The color of the ball which can be yellow",
                    "enumValue2b":"Or pink might make a difference",
                    "enumValue3a":"The starting position of the ball, which can be higher",
                    "enumValue3b":"Or lower might make a difference",
                    "enumValue4a":"And the surface texture of the ramp, which can be rough",
                    "enumValue4b":"Or smooth.  This might also make a difference",
                    "rqselectedall":" affect the speed of the ball at the bottom of the ramp?",
                    "RQ1":{
                        "rqselected":"Does the slope of the ramp"
                        },
                    "RQ2":{
                        "rqselected":"Does the color of the ball"
                        },
                    "RQ3":{
                        "rqselected":"Does the starting position of the ball"
                        },
                    "RQ4":{
                        "rqselected":"Does the surface texture of the ramp"
                        }
                },
                "T2":{
                    "wewillselect":"we will select the topic the time for objects to sink",
                    "belowarevariables":"Below are some variables that might affect the time it takes for objects to sink in water.",
                    "enumVar1":"Density of the Water",
                    "enumVar2":"Shape of the Object",
                    "enumVar3":"Volume of the Object",
                    "enumVar4":"Density of the Object",
                    "enumUtt4":"And the density of the Object",
                    "enumMat1":"A stopwatch",
                    "enumMat2":"A lead or glass object",
                    "enumMat3":"A graduated cylinder",
                    "enumMat4":"And water",
                    "enumProcess1":"We will place an object into a graduated cylinder filled with water.",
                    "enumProcess2":"It will sink to the bottom.",
                    "enumProcess3":"We can measure the time it takes for the object to sink in water.",
                    "fourcanchange":"In this experiment, there are only four things we can change. Any of these might make a difference in the time of it takes for objects to sink in water. These are the four variables you can test in this experiment",
                    "enumValue1a":"The density of the water, which can be lower",
                    "enumValue1b":"Or higher might make a difference",
                    "enumValue2a":"The shape of the object which can be a sphere",
                    "enumValue2b":"Or tear-shaped might make a difference",
                    "enumValue3a":"The volume of the object which can be smaller",
                    "enumValue3b":"Or larger might make a difference",
                    "enumValue4a":"And the density of the object which can be higher",
                    "enumValue4b":"Or lower.  This might also make a difference",
                    "rqselectedall":" affect the time it takes for objects to sink in water?",
                    "RQ1":{
                        "rqselected":"Does the density of water"
                        },
                    "RQ2":{
                        "rqselected":"Does the shape of the object"
                        },
                    "RQ3":{
                        "rqselected":"Does the volume of the object"
                        },
                    "RQ4":{
                        "rqselected":"Does the density of the object"
                        }
                }
            },
            "A4":{
                "withinarea":"Within the area of Plant growth",
                "T1":{
                    "wewillselect":"we will select the topic flower reproduction",
                    "belowarevariables":"Below are some variables that might affect the number of seeds produced by flowers in a greenhouse.",
                    "enumVar1":"The Number of honey bees in the greenhouse",
                    "enumVar2":"The Amount of sunlight the greenhouse lets in",
                    "enumVar3":"The Amount of Fertilizer",
                    "enumVar4":"The Type of Water",
                    "enumUtt4":"And the Type of Water",
                    "enumMat1":"A greenhouse",
                    "enumMat2":"Twelve sunflower plants",
                    "enumMat3":"A beehive with bees",
                    "enumMat4":"Fertilizer",
                    "enumMat5":"And water",
                    "enumProcess1":"We will plant twelve sunflowers in the ground in a greenhouse at the beginning of Spring.",
                    "enumProcess2":"The flowers will produce seeds then die by the end of the season.",
                    "enumProcess3":"We can measure the number of seeds produced by the flowers at the end of the season. ",
                    "fourcanchange":"In this experiment, there are only four things we can change. Any of these might make a difference in the number of seeds produced by the flowers at the end of the season. These are the four variables you can test in this experiment",
                    "enumValue1a":"The number of honey bees in the greenhouse, which can be zero",
                    "enumValue1b":"Or a whole hive might make a difference",
                    "enumValue2a":"The amount of sunlight the greenhouse lets in, which can be full sunlight",
                    "enumValue2b":"Or partial sunlight might make a difference",
                    "enumValue3a":"The amount of fertilizer, which can be none",
                    "enumValue3b":"Or some might make a difference",
                    "enumValue4a":"And the type of water, which can be rain water",
                    "enumValue4b":"Or tap water.   This might also make a difference",
                    "rqselectedall":" affect the number of seeds produced by flowers at the end of the season?",
                    "RQ1":{
                        "rqselected":"Does the number of honey bees in the greenhouse"
                        },
                    "RQ2":{
                        "rqselected":"Does the amount of sunlight the greenhouse lets in"
                        },
                    "RQ3":{
                        "rqselected":"Does the type of water"
                        },
                    "RQ4":{
                        "rqselected":"Does the amount of fertilizer"
                        }
                },
                "T2":{
                    "wewillselect":"we will select the topic algae growth",
                    "belowarevariables":"Below are some variables that might affect the amount of algae growth in water.",
                    "enumVar1":"The Temperature of the Water",
                    "enumVar2":"The Amount of Exposure to Music",
                    "enumVar3":"The Amount of Carbon Dioxide in the Water",
                    "enumVar4":"The Amount of Direct Sunlight Exposure",
                    "enumUtt4":"And the Amount of Direct Sunlight Exposure",
                    "enumMat1":"A radio",
                    "enumMat2":"A calendar",
                    "enumMat3":"A digital scale",
                    "enumMat4":"A fish tank heater",
                    "enumMat5":"Fifty grams of algae",
                    "enumMat6":"A fish tank filled with 16 liters of water",
                    "enumMat7":"A thermometer",
                    "enumMat8":"And a carbon dioxide machine",
                    "enumProcess1":"We will add fifty grams of algae to a fish tank filled with 16 liters of distilled water.",
                    "enumProcess2":"We can measure the weight of the algae growth after one week.",
                    "fourcanchange":"In this experiment, there are only four things we can change. Any of these might make a difference in the weight of the algae after one week. These are the four variables you can test in this experiment",
                    "enumValue1a":"The temperature of the water, which can be room temperature",
                    "enumValue1b":"Or a warmer might make a difference",
                    "enumValue2a":"The amount of exposure to music which can be constant music",
                    "enumValue2b":"Or no music might make a difference",
                    "enumValue3a":"The amount of carbon dioxide , which can be a lot",
                    "enumValue3b":"Or none might make a difference",
                    "enumValue4a":"And the amount of direct sunlight exposure, which can be some",
                    "enumValue4b":"Or none.   This might also make a difference",
                    "rqselectedall":" affect the weight of the algae growth after one week?",
                    "RQ1":{
                        "rqselected":"Does the temperature of the water"
                        },
                    "RQ2":{
                        "rqselected":"Does the exposure to music"
                        },
                    "RQ3":{
                        "rqselected":"Does the amount of carbon dioxide in the water"
                        },
                    "RQ4":{
                        "rqselected":"Does the amount of direct sunlight exposure"
                        }
                }
            }
        },
        "EG": {
            "BOTH": {
                "track1":"In this lesson, we will ask you to set up and evaluate experiments.",
                "track8":"You will set up (but not run) an experiment on the computer to answer the research question that you have selected.",
                "track9":"Let's begin by focusing on one area of science"

            },
            "A1": {
                "type": "choice",                
                "pronoun": "you",
                "selecttopic":"please select a topic by clicking on a picture below.",
                "selecttv":"Select the variable you would like to test. This variable is the independent variable of your experiment.",
                "rqselected":"The research question you have chosen is",
                "okselected":"OK! You have chosen as your Research Question",
                "cantest":"You can test one of these variables in your experiment.",
                "track2":"But first you will select a general area for the experiment.",
                "track3":"For example, you might select the general area of psychology.",
                "track4":"After you select the general area, you will then select a specific topic within that area.",
                "track5":"For example, within the general area of psychology, you might select the topic attention to color.",
                "track6":"Within that topic, you will select a research question.",
                "track7":"For example, within the topic of attention to color, you might select a research question such as does the color of the t-shirt a person is wearing affect attention?",
                "rqselectedall":""
            },
            "A2": {
                "type": "no choice",
                "pronoun": "we",
                "selecttopic":"Please click the highlighted picture below.",
                "selecttv":"We will test the following variable:",
                "selecttv2":", This variable is the independent variable of the experiment. Please click on the highlighted button below",
                "rqselected":"Our research question is",
                "okselected":"OK! We have chosen the following Research Question",
                "cantest":"We can test one of these variables in the experiment.",
                "track2":"But first we will select a general area for the experiment.",
                "track3":"For example, we might select the general area of psychology.",
                "track4":"After we select the general area, we will then select a specific topic within that area.",
                "track5":"For example, within the general area of psychology, we might select the topic attention to color.",
                "track6":"Within that topic, we will select a research question.",
                "track7":"For example, within the topic of attention to color, we might select a research question such as does the color of the t-shirt a person is wearing affect attention?",
                "rqselectedall":""
            }

        }
        
    }
}